#Math Solve : Day of Month : February 
#Page 32 of CU python101_labbook_v1.0.1 
#มี 1 บรรทัด ประกอบด้วยจำนวนเต็ม 2 ตัว คือ เดือนและปีเป็นพุทธศักราช 
# Output: จำนวนวันของเดือนและปีของข้อมูลนำเข้า
#ให้เขียนโปรแกรมเพื่อรับค่าเดือนและปีเป็นพุทธศักราช จากนั้นหาว่าในเดือนของปีนั้น จะมีจำนวนวันทั้งสิ้นกี่วัน
#ตัวช่วย: เดือนกุมภาพันธ์มี 29 วัน ก็ต่อเมื่อ (ปี ค.ศ. หารด้วย 4 ลงตัว แต่หารด้วย 100 ไม่ลงตัว) หรือ (ปี ค.ศ. หารด้วย 400 ลงตัว)

m = int(input("m ="))
y1 = int(input("y1 ="))
y = y1-543
d = 28
if  m == 4 or m == 6 or m == 9 or m == 11 :
    d = 30 
    print(d)
else :
    if m != 2 and not(m ==4 or m == 6 or m ==9 or m ==11) :
        d = 31
        print(d)
    else : 
        if y % 400 == 0 or y % 4 == 0 and y % 100 != 0 : 
            d = 29  
            print(d)
        else :
            d = 28
            print(d)
